SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/vftРапортОПоврежденииНеисправности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftРапортОПоврежденииНеисправности</name>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Статус2</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механизм_Система</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобреноКолВоПозиций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказаноКуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитанаПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыполнено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументаРапортОПовреждении</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияДефекта</name>
    <type>
      <types>DocumentRef.впВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаСнабжение</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребуемыеДействия</name>
    <attributes>
      <name>НеобходимыеСЗЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КаталожныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявкиТС3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявкиТС3</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобходимыеРемонтыеРаботы</name>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОписаниеНеисправностей</name>
    <attributes>
      <name>ОписаниеНеисправности</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/vftСтатусыДокументаРапортОПовреждении/vftСтатусыДокументаРапортОПовреждении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументаРапортОПовреждении</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/Forms/ФормаДокумента/Module.bsl
#Область События_формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//rarus_rasuli_30.03.18 ++
	vftОбщиеПроцедурыДокументовСервер.ПриСозданииНаСервереРапорт(Отказ,Объект);
	 //rarus_rasuli_30.03.18 --
	 
	 //rarus_rasuli_30.03.18 ++
	vftОбщиеПроцедурыДокументовСервер.УстановитьКнопкиИзмененияСтатусаРапорт(ЭтаФорма,Элементы.ПодменюСтатус,Объект.Статус);	
	//rarus_rasuli_30.03.18 --
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
	
	//rarus_rasuli_30.03.18 ++
	ЭтаФорма.ТолькоПросмотр =  НЕ vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможностьРедактироватьФормуПоСтатусуРапорт(Объект.Статус);
	//rarus_rasuli_30.03.18 --

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаОткрытия = ТекущаяДата();
		Объект.ДатаРассмотрения = ТекущаяДата();
	КонецЕсли; 	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры
#КонецОбласти 

#Область События_Элементов_формы
&НаСервере
Процедура ПредложенияПриАктивизацииСтрокиСервер()
	
	ТекСтрока = Элементы.Предложения.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		
		Элементы.Предложение.ПутьКДанным				= "Объект.Предложения[" + ТекСтрока + "].Предложение";
		Элементы.ОтветКомпанииНаПредложение.ПутьКДанным = "Объект.Предложения[" + ТекСтрока + "].ОтветКомпании";  
		
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтветКомпанииНаПредложениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		ТекущиеДанные.ответственный = ТекущийПользователь;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		ТекущиеДанные.ЕстьОтвет = ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);

	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура НетПредложенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если  ТекущиеДанные.НетПредложения Тогда
			Элементы.Предложения.ТекущиеДанные.Предложение = "";
		КонецЕсли; 
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);
		ТекущиеДанные.ЕстьОтвет 		= ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);
		ТекущиеДанные.НетПредложения 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),Ложь,Истина);
		ТекущиеДанные.ЕстьОтвет 		= ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветКомпанииПриИзменении(Элемент)
	Объект.Ответственный = ТекущийПользователь;
КонецПроцедуры

#КонецОбласти 

#Область Служебные

&НаСервере
Процедура ЗаполнитьСУБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	vftСУБ.Ссылка КАК Суб
	|ИЗ
	|	Справочник.vftСУБ КАК vftСУБ
	|ГДЕ
	|	vftСУБ.Архивный = ЛОЖЬ
	|	И vftСУБ.ПометкаУдаления = ЛОЖЬ";
	
	Объект.Предложения.Загрузить(Запрос.Выполнить().Выгрузить())
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФлажкиОтветов()
	
	Для Каждого СтрокаТаблицы из Объект.Предложения Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Предложение) тогда
			СтрокаТаблицы.ЕстьПредложение = 2;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОтветКомпании) тогда
			СтрокаТаблицы.ЕстьОтвет = 2;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти 

#Область Управление_Доступностью

&НаСервере
Процедура УстановитьДоступностьРеквизитов();
	
	МассивНедоступныхДляРедатированияРеквизитов = ПолучитьЗапрещенныеРеквизиты();
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьРеквизитов(ЭтаФорма,МассивНедоступныхДляРедатированияРеквизитов,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеРеквизиты()
	
	Возврат	ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов().Получить(Объект.Статус);
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов() Экспорт
	
	Соответствие = Новый Соответствие;  

	МассивВсеРеквизиты = vftОбщиеПроцедурыДокументовСервер.ПолучитьВсеЭлементыФормыДокумента(Объект,Ложь);
	Если ГлавныйУзел тогда
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик	,МассивВсеРеквизиты);	
		
		МассивОтправлен = vftОбщиеПроцедурыДокументовСервер.СкопироватьМассивСтрок(МассивВсеРеквизиты,"#ОтветственныйПоНеисправности#ФИОКапитанаПоНеисправности#");		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен	,МассивОтправлен);
		//rarus_rasuli_30.03.18 ++
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Рассмотрен,МассивОтправлен);
		//rarus_rasuli_30.03.18 ++
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Закрыт		,МассивВсеРеквизиты);

	Иначе
		
		МассивЧерновик = Новый Массив;
		МассивЧерновик.Добавить("ОтветственныйПоНеисправности");
		МассивЧерновик.Добавить("ФИОКапитанаПоНеисправности");
		МассивЧерновик.Добавить("КемВыполнено");
		МассивЧерновик.Добавить("ДатаВыполнения");
		
		///rarus_rasuli_29.11.17
		МассивЧерновик.Добавить("Механик");
		МассивЧерновик.Добавить("ДатаРассмотрения");
		МассивЧерновик.Добавить("ЗаказаноКуда");
		МассивЧерновик.Добавить("ОдобреноКолВоПозиций");
		МассивЧерновик.Добавить("ЗаявкаНомер");
		
		МассивОтправлен = Новый Массив;
		МассивОтправлен.Добавить("Ответственный");
		МассивОтправлен.Добавить("ФИОКапитана");
		
		МассивОтправлен.Добавить("ОтветственныйПоНеисправности");
		МассивОтправлен.Добавить("ФИОКапитанаПоНеисправности");
		МассивОтправлен.Добавить("КемВыполнено");
		МассивОтправлен.Добавить("ДатаВыполнения");
		
		МассивПолучен = Новый Массив;
		МассивПолучен.Добавить("Ответственный");
		МассивПолучен.Добавить("ФИОКапитана");
		
		МассивПолучен.Добавить("Механик");
		МассивПолучен.Добавить("ДатаРассмотрения");
		МассивПолучен.Добавить("ЗаявкаНомер");
		МассивПолучен.Добавить("ЗаказаноКуда");
		МассивПолучен.Добавить("ОдобреноКолВоПозиций");
		
		МассивРассмотерен = Новый Массив;
		МассивРассмотерен.Добавить("Механик");
		МассивРассмотерен.Добавить("ДатаРассмотрения");
		МассивРассмотерен.Добавить("ЗаявкаНомер");
		МассивРассмотерен.Добавить("ЗаказаноКуда");
		МассивРассмотерен.Добавить("ОдобреноКолВоПозиций");
	
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик, МассивЧерновик);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен, МассивОтправлен);
		 ///rarus_rasuli
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Рассмотрен, МассивРассмотерен);
		///rarus_rasuli
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Получен,  МассивПолучен);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументаРапортОПовреждении.Закрыт,   МассивВсеРеквизиты);
		///rarus_rasuli_29.11.17

	КонецЕсли;
	
	
	
	Возврат  Соответствие;
	
КонецФункции

&НаКлиенте
Процедура РазрешитьРедактированиеВсехРеквизитов(Команда)
	
РазрешитьРедактированиеВсехРеквизитовСервер();	

КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеВсехРеквизитовСервер()
	
vftОбщиеПроцедурыДокументовСервер.РазрешитьРедактированиеВсехРеквизитов(ЭтаФорма);	

КонецПроцедуры

#КонецОбласти

#Область Кнопки_Изменения_Статуса

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИзмененияСтатуса(Команда)
	
	Объект.Статус = vftОбщиеПроцедурыДокументовКлиент.ПолучитьСтатусПоИмениКомандыРапорт(Команда.Имя);
	 
	/////rarus_rasuli_26.02.18 ++
	ИзменениеДатыПриСтатусеОтправлен();
	/////rarus_rasuli_26.02.18 --

КонецПроцедуры

&НаСервере
Функция ПолучитьВозможныеСтатусы() Экспорт
	//rarus_rasuli_30.03.18
	Возврат vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможныеСтатусыРапорт();
	//rarus_rasuli_30.03.18	
КонецФункции

/////rarus_rasuli_26.02.18 ++
  &НаСервере
Функция ИзменениеДатыПриСтатусеОтправлен() 
	
	/////rarus_rasuli
	Если Объект.Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	/////rarus_rasuli
		

КонецФункции
/////rarus_rasuli_26.02.18 --

#КонецОбласти
